{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9(\u0000\u0000\u0000\u00e9\u00a0\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\tmodel1.py\u00da\fresize_comma_\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true}}, {"class_name": "Lambda", "config": {"name": "lambda_2", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\tmodel1.py\u00da\b<lambda>s\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "output_shape": null, "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_1", "subsample": [4, 4], "b_constraint": null, "nb_col": 8, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_filter": 16, "activity_regularizer": null, "nb_row": 8, "init": "glorot_uniform", "border_mode": "same"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_2", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_filter": 32, "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "border_mode": "same"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "name": "convolution2d_3", "subsample": [2, 2], "b_constraint": null, "nb_col": 5, "trainable": true, "bias": true, "activation": "linear", "dim_ordering": "tf", "b_regularizer": null, "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "border_mode": "same"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_1", "b_constraint": null, "input_dim": 1920, "trainable": true, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 512, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_2", "b_constraint": null, "input_dim": 512, "trainable": true, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 50, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "dense_3", "b_constraint": null, "input_dim": 50, "trainable": true, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "activation": "linear"}}]}